import engine.SimpleDecrypt;

import java.util.Scanner;

class Main {
    public static void main(String[] args){
        SimpleDecrypt simpleDecrypt = new SimpleDecrypt();
        String text =
                "Еъёчхф Вхзёюлх, адздёиу ф ждэщхб, црбх еёдюэчъщъгюъв южаижжзчх, ждчъёнъгжзчдв. Ъы зёюивй жёхчгюв бюнс ж ъы вдгивъгзхбсгрв аёхкдв. \n" +
                "Зъеъёс вгъ дмъчющгд, мзд гъюэцъьгджзс тздшд аёхкх фчбфъзжф жбъщжзчюъв гъждчъёнъгжзчх мъбдчъмъжадшд югщючющиивх. \n" +
                "Ф юэимюб чхни южздёюу ю чгыж юэвъгъгюф, здмгъъ дзёхэюч еджздфггиу юэвъгмючджзс мъбдчъмъжаюк едёдадч. \n" +
                "Ю зъв гъ въгъъ, еджбъщдчхбх гъищхмх. Ф еёюнъб а чрчдщи, мзд чюгдя чжъви вдя югзъббъаз, х чдэвдьгд, вды мёъэвъёгдъ жзёъвбъгюъ ад чжъви шхёвдгюмгдви. \n" +
                "Гхязю ёънъгюъ вгъ едвдшбх еёдшёхввх югзиюзючгдшд зюех, жеълюхбсгд ждэщхггхф щбф юэимъгюф деёъщъбъггрк жздёдг мъбдчъмъжадя щиню. \n" +
                "Въгф вдьгд гхэчхзс дзлдв Вхзёюлр, х ъы, цъэ еёъичъбюмъгюф, вхзъёсу.";
        Scanner in = new Scanner(System.in);
        System.out.print("Необходимо ввести длину смещения, если задать 0, то k пройдётся по всем доступным вариантам, для поиска необходимого смещения. k = ");
        int k = in.nextInt();
        System.out.print("Необходимо ввести длину, если задать 0, то длина выставится от изначального текста. Длина = ");
        int length = in.nextInt();
        String uncryptText = simpleDecrypt.BrutForce(text, k, length);
        System.out.println(uncryptText);
    }

}